manoj153/STM32F1BOARD/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		//<>TestCode Start </>
		/*Functions : Blink all the leds on board
		Blinks : 1000ms 
		Each group, 1 Green Led + 4 Red Led
		Has 6CH/aka group, Thus 30 LEDS*/
		//<>TestCode Ends </>
		//#Toggle 6CH, Green LED
		HAL_GPIO_TogglePin(CH1_G_GPIO_Port, CH1_G_Pin);
		HAL_GPIO_TogglePin(CH2_G_GPIO_Port, CH2_G_Pin);
		HAL_GPIO_TogglePin(CH3_G_GPIO_Port, CH3_G_Pin);
		HAL_GPIO_TogglePin(CH4_G_GPIO_Port, CH4_G_Pin);
		HAL_GPIO_TogglePin(CH5_G_GPIO_Port, CH5_G_Pin);
		HAL_GPIO_TogglePin(CH6_G_GPIO_Port, CH6_G_Pin);
		
		//#Toggle 1-6CH, Red LED  (4*6 = 24)
		//#CH1R-1 - CH1R-4
		HAL_GPIO_TogglePin(CH1_1R_GPIO_Port, CH1_1R_Pin);
		HAL_GPIO_TogglePin(CH1_2R_GPIO_Port, CH1_2R_Pin);
		HAL_GPIO_TogglePin(CH1_3R_GPIO_Port, CH1_3R_Pin);
		HAL_GPIO_TogglePin(CH1_4R_GPIO_Port, CH1_4R_Pin);
		//#CH2R-1 - CH2R-4
		HAL_GPIO_TogglePin(CH2_1R_GPIO_Port, CH2_1R_Pin);
		HAL_GPIO_TogglePin(CH2_2R_GPIO_Port, CH2_2R_Pin);
		HAL_GPIO_TogglePin(CH2_3R_GPIO_Port, CH2_3R_Pin);
		HAL_GPIO_TogglePin(CH2_4R_GPIO_Port, CH2_4R_Pin);
		//#CH3R-1 - CH3R-4
		HAL_GPIO_TogglePin(CH3_1R_GPIO_Port, CH3_1R_Pin);
		HAL_GPIO_TogglePin(CH3_2R_GPIO_Port, CH3_2R_Pin);
		HAL_GPIO_TogglePin(CH3_3R_GPIO_Port, CH3_3R_Pin);
		HAL_GPIO_TogglePin(CH3_4R_GPIO_Port, CH3_4R_Pin);
		//#CH4R-1 - CH4R-4
		HAL_GPIO_TogglePin(CH4_1R_GPIO_Port, CH4_1R_Pin);
		HAL_GPIO_TogglePin(CH4_2R_GPIO_Port, CH4_2R_Pin);
		HAL_GPIO_TogglePin(CH4_3R_GPIO_Port, CH4_3R_Pin);
		HAL_GPIO_TogglePin(CH4_4R_GPIO_Port, CH4_4R_Pin);
		
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	HAL_Delay(1000);
  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USART1 init function */
static void MX_USART1_UART_Init(void)
{

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOE, CH6_2R_Pin|CH6_3R_Pin|CH6_4R_Pin|CH1_2R_Pin 
                          |CH1_1R_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, PWR_SYSF_Pin|ASYS_F_Pin|PWR_LED_Pin|RLY1_Pin 
                          |Beep_Pin|TESTpb_Pin|MUTEpb_Pin|CH6_G_Pin 
                          |CH5_1R_Pin|CH4_4R_Pin|CH4_3R_Pin|CH4_2R_Pin 
                          |CH4_1R_Pin|CH3_4R_Pin|CH3_3R_Pin|CH3_2R_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, CH5_G_Pin|CH4_G_Pin|CH3_G_Pin|CH2_G_Pin 
                          |CH5_4R_Pin|CH5_3R_Pin|CH5_2R_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, CH1_G_Pin|CH6_1R_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, CH3_1R_Pin|CH2_4R_Pin|CH2_3R_Pin|CH2_2R_Pin 
                          |CH2_1R_Pin|CH1_4R_Pin|CH1_3R_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : CH6_2R_Pin CH6_3R_Pin CH6_4R_Pin CH1_2R_Pin 
                           CH1_1R_Pin */
  GPIO_InitStruct.Pin = CH6_2R_Pin|CH6_3R_Pin|CH6_4R_Pin|CH1_2R_Pin 
                          |CH1_1R_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : CH1_1_Pin CH1_2_Pin CH1_3_Pin CH1_4_Pin */
  GPIO_InitStruct.Pin = CH1_1_Pin|CH1_2_Pin|CH1_3_Pin|CH1_4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : CH2_1_Pin CH2_2_Pin */
  GPIO_InitStruct.Pin = CH2_1_Pin|CH2_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : CH2_3_Pin CH2_4_Pin CH3_1_Pin CH5_3_Pin 
                           CH5_4_Pin CH6_1_Pin CH6_2_Pin CH6_3_Pin 
                           CH6_4_Pin */
  GPIO_InitStruct.Pin = CH2_3_Pin|CH2_4_Pin|CH3_1_Pin|CH5_3_Pin 
                          |CH5_4_Pin|CH6_1_Pin|CH6_2_Pin|CH6_3_Pin 
                          |CH6_4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : CH3_2_Pin CH3_3_Pin CH3_4_Pin CH4_1_Pin 
                           CH4_2_Pin CH4_3_Pin CH4_4_Pin CH5_1_Pin 
                           CH5_2_Pin */
  GPIO_InitStruct.Pin = CH3_2_Pin|CH3_3_Pin|CH3_4_Pin|CH4_1_Pin 
                          |CH4_2_Pin|CH4_3_Pin|CH4_4_Pin|CH5_1_Pin 
                          |CH5_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : PWR_SYSF_Pin ASYS_F_Pin PWR_LED_Pin RLY1_Pin 
                           Beep_Pin TESTpb_Pin MUTEpb_Pin CH6_G_Pin 
                           CH5_1R_Pin CH4_4R_Pin CH4_3R_Pin CH4_2R_Pin 
                           CH4_1R_Pin CH3_4R_Pin CH3_3R_Pin CH3_2R_Pin */
  GPIO_InitStruct.Pin = PWR_SYSF_Pin|ASYS_F_Pin|PWR_LED_Pin|RLY1_Pin 
                          |Beep_Pin|TESTpb_Pin|MUTEpb_Pin|CH6_G_Pin 
                          |CH5_1R_Pin|CH4_4R_Pin|CH4_3R_Pin|CH4_2R_Pin 
                          |CH4_1R_Pin|CH3_4R_Pin|CH3_3R_Pin|CH3_2R_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : CH5_G_Pin CH4_G_Pin CH3_G_Pin CH2_G_Pin 
                           CH5_4R_Pin CH5_3R_Pin CH5_2R_Pin */
  GPIO_InitStruct.Pin = CH5_G_Pin|CH4_G_Pin|CH3_G_Pin|CH2_G_Pin 
                          |CH5_4R_Pin|CH5_3R_Pin|CH5_2R_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : CH1_G_Pin CH6_1R_Pin */
  GPIO_InitStruct.Pin = CH1_G_Pin|CH6_1R_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : CH3_1R_Pin CH2_4R_Pin CH2_3R_Pin CH2_2R_Pin 
                           CH2_1R_Pin CH1_4R_Pin CH1_3R_Pin */
  GPIO_InitStruct.Pin = CH3_1R_Pin|CH2_4R_Pin|CH2_3R_Pin|CH2_2R_Pin 
                          |CH2_1R_Pin|CH1_4R_Pin|CH1_3R_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
